#pragma once
#include <functional>
#include <opencv2/core.hpp>

#define BSIZE 8

void bgr2ycrcb(cv::Mat &image);

void blkproc(cv::Mat &, std::function<void(cv::Mat &, int, float)>, int = 0,
             float = 0.0F);

namespace blk {
constexpr float qmatrix[3][64] = {{16, 11, 10, 16, 24, 40, 51, 61, 12, 12, 14, 19, 26, 58, 60, 55, 14, 13, 16, 24, 40, 57, 69, 56, 14, 17, 22, 29, 51, 87, 80, 62, 18, 22, 37, 56, 68, 109, 103, 77, 24, 35, 55, 64, 81, 104, 113, 92, 49, 64, 78, 87, 103, 121, 120, 101, 72, 92, 95, 98, 112, 100, 103, 99}, {17, 18, 24, 47, 99, 99, 99, 99, 18, 21, 26, 66, 99, 99, 99, 99, 24, 26, 56, 99, 99, 99, 99, 99, 47, 66, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99}, {17, 18, 24, 47, 99, 99, 99, 99, 18, 21, 26, 66, 99, 99, 99, 99, 24, 26, 56, 99, 99, 99, 99, 99, 47, 66, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99}}; // constexpr <- 完全なる定数．型をつけられる．コンパイル前から値を決められる．
void mozaic(cv::Mat &in, int p0, float p1);
void dct2(cv::Mat &in, int p0, float p1);
void idct2(cv::Mat &in, int p0, float p1);
void quantize(cv::Mat &in, int p0, float p1);
void dequantize(cv::Mat &in, int p0, float p1);
}
